perf/breakpoint/rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  http:
    pool: 200
  phases:
    - name: Ramp
      duration: 120
      arrivalRate: 250
      rampTo: 1000
    

scenarios:
  - name: Rates (/rates)
    flow:
      - get:
          url: '/rates'